<?php
$exp_kan = [
  SUIMEI_KAN_KINOE => "日干が甲の人は、「甲木参天」といわれ、上を目指してまっすぐ伸びていく大木にたとえられます。
  上を目指すというところから向上心に溢れるとか、自分をもっと成長させたいという欲求が強いというような長所と、
  理想ばかりで現実がおろそかになるとか、見栄や体裁ばかり木にするといった短所も表します。",
  SUIMEI_KAN_KINOTO => "日干が乙の人は、「乙木雖柔」といわれ、柔軟な姿勢で現実に対処しながら茂っていく
  草木などにたとえられます。とりあえず今の現実を無視せず、与えられた環境の中でいかに上手く
  生き延びていくかという姿勢を表します。したたかさや粘り強さも表します。",
  SUIMEI_KAN_HINOE => "日干が丙の人は、「丙火猛烈」といわれ、分け隔てなく周囲に熱と光を放ち、
  与え続ける太陽にたとえられます、任せて安心の頼もしい感じで、決断力や実行力がありますが、
  短所化すると騒がしく、押し付けがましい迷惑な人にもなりかねません。本人は意識しなくても何かと人目につくことが多いでしょう。",
  SUIMEI_KAN_HINOTO => "日干が丁の人は、「丁火柔中」といわれ、内側に熱とエネルギーを秘めながら静かに燃えている炎に例えられます。
  内面の情熱はとても強いのですが、しっかり準備をしてから動き出すので、おとなしく弱い人に見られがちですが、
  ひとたび活動を始めると、やはり炎の人であったと納得できるような大きな行動力を示します。",
  SUIMEI_KAN_TSUCHINOE => "日干が戊の人は、「戊土固重」といわれ、堅く思い、あるいは堅く重なった大地に例えられます。
  いたずらに過去を思い起こしてくよくよしたり、わからない未来のことを心配するのではなく、
  今、ここを大事にする信念の人です。悪くすると融通の利かない頭の硬さとなりますが、一度こうだと思ったことや人に対する信頼は厚く
  信念を持って人生を歩みます。",
  SUIMEI_KAN_TSUCHINOTO => "日干が己の人は、「己土卑湿」といわれ、潤いと庶民性、柔軟性を持った田園の土にたとえられます。
  水分を吸収するかのようにものを学び習得することが得意です。多芸多才であるとも言えます。悪い面が出ると一つのことに集中しづらく、
  あれこれ手を出してまとまりがつかないとか、一度迷い出すときりがないなどの特徴もあります。",
  SUIMEI_KAN_KANOE => "日干が庚の人は、「庚金帯殺」といわれ、殺気を帯びた刀剣やとても硬い鋼鉄にたとえられます。
  武器を振り回して勝負に出るときは躊躇していないで一気に出なくてはなりませんので、決断力、行動力に優れています。
  負けず嫌いで、迷っているくらいなら行動せよとの信念の人でもあります。悪くすると攻撃的で恐ろしい人になます。",
  SUIMEI_KAN_KANOTO => "日干が辛の人は、「辛金軟弱」といわれ、弱く柔らかい金属、つまり貴金属にたとえられます。
  キラキラと輝き、飾ることが好きなイメージです。自尊心や見栄も強いでしょう。新しい物好きで、容量も良いので、
  すぐ自分のものにしてしまいます。悪い面が出ると、回るの評判や反応を気にしすぎて自分をすり減らしてしまいます。",
  SUIMEI_KAN_MIZUNOE => "日干が壬の人は、「壬水通河」といわれ、川に通じて海に流れ込む水。
  おとなしくコップに入っている水ではなく、大地の上をあちらこちらと流れいくダイナミックな水です。
  好奇心旺盛で、何事も体験して見て納得する人です。悪い点が出ると無責任にその場を流れ去ってしまう人になったり、
  その時の気分次第で無定見に流されていく人になったりもします。",
  SUIMEI_KAN_MIZUNOTO => "日干が癸の人は、「癸水至弱」といわれ、いたって弱いとされますが、弱いというよりは流れない水です。
  空気中の水蒸気のように冷えて水滴となるまでは形を表しません。形のないもの（理論や理想、空想、イメージなど）
  をあやつることが特異であり、想像力も豊かです。悪くすると邪推と偏見の人となります。しつこく絡むことも。"
];

/*$exp_tsuhen = [
  SUIMEI_TSUHEN_HIKEN => '比肩の人は、自分の信念にしたがって一生懸命努力する人です。
  とても向上心があります。悪く出ると周囲との話を乱す恐れもあります。',
  SUIMEI_TSUHEN_GOZAI => '',
  SUIMEI_TSUHEN_SHOKUSHIN => '',
  SUIMEI_TSUHEN_SHOKAN => '',
  SUIMEI_TSUHEN_HENZAI => '',
  SUIMEI_TSUHEN_SEIZAI => '',
  SUIMEI_TSUHEN_HENKAN => '',
  SUIMEI_TSUHEN_SEIKAN => '',
  SUIMEI_TSUHEN_HENIN => '',
  SUIMEI_TSUHEN_INJU => '',
];*/